# Task 3
# Реализовать склонение слова «процент» для чисел до 20.
# Например, задаем число 5 — получаем «5 процентов», задаем число 2 —
# получаем «2 процента». Вывести все склонения для проверки.

my_percent = int(input('Введите число процента: '))
if my_percent == 1:
    word = 'процент'
elif my_percent <= 4:
    word = 'процента'
else:
    word = 'процентов'

print(my_percent, word)
